# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [1]:
import pandas as pd

In [2]:
pd

** Read Salaries.csv as a dataframe called sal.**

In [40]:
df = pd.read_csv('Salaries.csv')  #data frame

** Check the head of the DataFrame. **

In [41]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [48]:
df.shape  #no of rows and coloumns

(148654, 14)

In [50]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status,title_len
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0,148654.000000
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN,19.131749
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN,7.232820
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN,4.000000
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN,14.000000
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN,18.000000
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN,25.000000
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN,50.000000

**What is the average BasePay ?**

In [52]:
df['BasePay'].mean()  #average of basepay

66325.4488404877

** What is the highest amount of OvertimePay in the dataset ? **

In [54]:
df['OvertimePay'].max()  #highest amount

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [55]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [57]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']  #display its totalpaybenefits

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [34]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [39]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [58]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,title_len
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN,26

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [46]:
df.drop(['Id','EmployeeName','JobTitle','Agency','Notes','Status'],axis=1).groupby('Year').mean()['OvertimePay']

Year
2011    4531.065429
2012    5023.417824
2013    5281.641980
2014    5401.993737
Name: OvertimePay, dtype: float64

** How many unique job titles are there? **

In [59]:
df['JobTitle'].nunique()

2159

** What are the top 5 most common jobs? **

In [60]:
df['JobTitle'].value_counts().head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [61]:
sum(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [23]:
def Chief_string(title):
    if 'chief'in title:
        return True
    else:
        return False

In [24]:
#column
df['JobTitle'].apply(lambda s:Chief_string(s.lower()))  #chief cheking in title..

0         False
1         False
2         False
3         False
4          True
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [63]:
sum(df['JobTitle'].apply(lambda s:Chief_string(s.lower())))

627

In [ ]:
#Listing all the job titles that has a 'chief' string in it

In [65]:
df[df['JobTitle'].apply(lambda s: Chief_string(s.lower()))]['JobTitle'].unique()

array(['DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)',
       'ASSISTANT DEPUTY CHIEF II', 'BATTALION CHIEF, (FIRE DEPARTMENT)',
       'CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
       'ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
       'CHIEF OF POLICE', 'DEPUTY CHIEF III (POLICE DEPARTMENT)',
       'CONFIDENTIAL CHIEF ATTORNEY II (CIVIL & CRIMINAL)',
       'CHIEF ATTORNEY I (CIVIL & CRIMINAL)',
       'ASSISTANT CHIEF ATTORNEY II',
       'CHIEF PROBATION OFFICER, JUVENILE COURT',
       'CHIEF ADULT PROBATION OFFICER', 'ASSISTANT CHIEF ATTORNEY I',
       'CHIEF DEPUTY SHERIFF',
       'ASST. CHIEF PROBATION OFFICER-JUVENILE PROBATION',
       "CHIEF DISTRICT ATTORNEY'S INVESTIGATOR",
       'CHIEF STATIONARY ENGINEER', 'CHIEF WATER SERVICE INSPECTOR',
       'CHIEF STATIONARY ENGINEER, WATER TREATMENT PLANT',
       'ASST. CHIEF, BUREAU OF CLAIMS INVEST. & ADMIN',
       'CHIEF BUILDING INSPECTOR', 'CHIEF PLUMBING INSPECTOR',
       'CHIEF ELECTRICAL INSPECTOR',
       'CHIEF STATIONARY ENGINEER, SEWAGE PLANT',
       'CHIEF HOUSING INSPECTOR',
       "ASSISTANT CHIEF DISTRICT ATTORNEY'S INVESTIGATOR",
       'CHIEF MICROBIOLOGIST', 'CHIEF SURVEYOR',
       'CHIEF FIRE ALARM DISPATCHER', 'CHIEF VICTIM/WITNESS INVESTIGATOR',
       'ASSISTANT CHIEF VICTIM/WITNESS INVESTIGATOR',
       'CHIEF NURSERY SPECIALIST', 'CHIEF DIETITIAN',
       'CHIEF PAYROLL AND PERSONNEL CLERK', 'CHIEF CLERK',
       'CHIEF DEPUTY ADULT PROBATION OFFICER', 'CHIEF TELEPHONE OPERATOR',
       'CHIEF PREPARATOR', 'Chief of Police', 'Chief, Fire Department',
       'Battlion Chief, Fire Suppressi', 'Assistant Deputy Chief 2',
       'Deputy Chief 3', 'Emergency Medical Svcs Chief',
       'Chief Atty1 (Civil & Criminal)', 'Chief Adult Probation Officer',
       'Assistant Chief Attorney 2', 'Assistant Chief Attorney 1',
       'Chief Deputy Sheriff', 'Chief Stationary Engineer',
       'Chief Water Service Inspector', 'Chief Building Inspector',
       'Chief Plumbing Inspector', 'Chief Electrical Inspector',
       'Chief Housing Inspector', 'Chief Dep Adlt Prob Of (SFERS)',
       'Chief Fire Alarm Dispatcher', 'Chief Surveyor',
       'Chief Nursery Specialist', 'Chief Dietitian', 'Chief Clerk',
       'Chief Preparator', 'Chief Telephone Operator',
       'Chief Deputy Adlt Probation Of', 'Battalion Chief, Fire Suppress',
       'Chief Investment Officer', 'Chief Forensic Toxicologist'],
      dtype=object)

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [43]:
df['title_len']=df['JobTitle'].apply(len)
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,title_len
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,31
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,31
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,36
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,44

In [44]:
df[['title_len','TotalPayBenefits']].corr()  #correlation

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

In [ ]:
#In the context of pandas, corr() is a method used to compute the correlation between columns in a DataFrame.
Correlation measures the statistical relationship between two variables, indicating how one variable may change as the other changes. 
The value ranges from -1 to 1:

1 indicates a perfect positive correlation.
-1 indicates a perfect negative correlation.
0 indicates no correlation.
    measures the relationship between two variables

# Great Job!